# Тема “Вычисления с помощью Numpy”

### Exercise 1

In [20]:
import numpy as np
a = np.array([[1, 2, 3, 3, 1],[6, 8, 11, 10, 7]]).T
print("a.shape: {}".format(a.shape))
print("a: {}".format(a))

mean_a = a.mean(axis=0)
print("mean_a: {}".format(mean_a))

a.shape: (5, 2)
a: [[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
mean_a: [2.  8.4]

### Exercise 2

In [25]:
a_centered = a - mean_a
print("a_centered: {}".format(a_centered))
print("a_centered.shape: {}".format(a_centered.shape))

a_centered: [[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]
a_centered.shape: (5, 2)

### Exercise 3

In [39]:
a_centered_sp = a_centered[:,0].dot(a_centered[:,1])
print("a_centered_sp: {}".format(a_centered_sp))

a_centered_sp /= a_centered.shape[0] - 1
print("a_centered_sp: {}".format(a_centered_sp))

a_centered_sp: 8.0
a_centered_sp: 2.0

### Exercise 4

In [93]:
np.cov(a.T)[1,0]

2.0

# Тема “Работа с данными в Pandas”

### Exercise 1

In [47]:
import pandas as pd

authors = pd.DataFrame({
    "author_id": [1, 2, 3],
    "author_name":  ['Тургенев', 'Чехов', 'Островский']
})
print(authors)

book = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price":  [450, 300, 350, 500, 450, 370, 290]
})
print(book)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский
   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Exercise 2

In [49]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Exercise 3

In [54]:
top5 = authors_price.sort_values(by='price', ascending=False).head()
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Exercise 4

In [76]:
groupby = authors_price.groupby("author_name")
authors_stat = groupby.agg({"price": ["min", "max", "mean"]})
authors_stat.columns = ["_".join(x[::-1]) for x in authors_stat.columns.ravel()]
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

### Exercise 5

In [89]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

book_info = pd.pivot_table(authors_price, 
                   values='price', index=['author_name'],
                   columns=['cover'], aggfunc=np.sum)
book_info = book_info.fillna(0)
print(book_info)

book_info.to_pickle("book_info.pkl")
book_info2 = pd.read_pickle("book_info.pkl")
print(book_info2)

if book_info.equals(book_info2):
    print('dataframes equals')

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0
cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0
dataframes equals